{"id":14,"date":"2016-09-20T16:01:27","date_gmt":"2016-09-20T21:01:27","guid":{"rendered":"https:\/\/www.roadtrips.com\/?page_id=14"},"modified":"2020-08-19T12:48:23","modified_gmt":"2020-08-19T17:48:23","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/www.roadtrips.com\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"<h3>Roadtrips Terms &amp; Conditions<\/h3>\n<p>Upon payment of the deposit, the buyers and travelers agree to be bound by the following terms and conditions.<\/p>\n<p>Roadtrips and sponsoring representative(s) (collectively “Roadtrips”) are acting solely as agents. Roadtrips is responsible for making the arrangements for accommodations, services and event tickets that constitute the travel package, except to the extent that those accommodations, services or event tickets cannot be supplied or become no longer available for reasons beyond Roadtrips’ control, including without limitation a Force Majeure event. Roadtrips shall not be liable to the traveler for loss or damage arising from prevention or delay in performance of its obligations where same is a result of a Force Majeure. For the avoidance of doubt, nothing shall excuse the traveler from any payment obligations under the agreement between Roadtrips and the traveler.<\/p>\n<p>Roadtrips shall not be liable, for any personal injury, property damage, inconvenience, loss of time, or any other loss or damage, direct or indirect, arising out of any act, omission or negligence of any direct air carrier, motor coach company, hotel or any other person rendering any service or providing any accommodation or event in conjunction with the travel package. Roadtrips shall not be liable, for any injury, loss or damage, direct or indirect, sustained as a result of theft, accident, mechanical breakdown, government action, Force Majeure event, failure to make timely payments, or any other reason beyond Roadtrips’ control.<\/p>\n<p>In these terms and conditions, “Force Majeure” includes but is not limited to acts of God, war, including armed conflict, strikes or labour disputes, riots, public health emergency, government regulation or advisory (including travel advisory warnings), civil disturbance, terrorism or threats of terrorism as substantiated by governmental warnings or advisory notices, curtailment of transportation services or facilities which would materially affect attendees from attending the event which is the subject of the agreement between Roadtrips and the traveler (the “Event”), disaster, fire, earthquakes, hurricanes, unseasonable extreme inclement weather, shortages or disruption of the electrical power supply causing blackouts or rolling blackouts or other essential utilities, or any other cause or causes, similar to or dissimilar to the foregoing, beyond the control of Roadtrips.<\/p>\n<p>If the Event is postponed or delayed or moved to a new venue or location as a result of a Force Majeure event: (a) Roadtrips may, at its sole option and without being liable for any loss or damage suffered by the traveler terminate this agreement forthwith by giving notice to that effect to the traveler; or (b) if no such notice is provided pursuant to paragraph (a) above and so long as the Event occurs within twenty-four months of the originally scheduled Event date, Roadtrips shall be deemed to have elected to perform its obligations under this agreement on the new date and\/or at the new venue or location and the traveler shall be bound to perform its respective obligations under this Agreement on the new date and\/or at the new venue or location and Roadtrips shall not be liable for any loss or damage suffered by the traveler as a result of the relocation and\/or delay. In the event that paragraph (b) above applies, Roadtrips may substitute any services being provided by Roadtrips to the traveler, including without limitation, air carrier, motor coach company and\/or hotel, with comparable services, to accommodate the change to the Event in its sole and absolute discretion without any liability whatsoever to the traveler.<\/p>\n<p><strong>Cancellations and Refunds<br \/>\n<\/strong>Roadtrips requires written notification of cancellation from the traveler. Cancellation notifications received before final payment is due are subject to a cancellation fee equal to the deposit payments. Cancellations received after final payment is due are subject to a cancellation fee equal to 100% of package amount. All travel documents, if issued, must be returned to Roadtrips prior to any refund being issued. Refunds shall not be given for unused travel services or any portion thereof. If cancellation by one or more travelers alters the room requirements of the remaining travelers, travelers still traveling may be required to pay a revised rate. Unless otherwise stated in the purchase order, group bookings are 100% non cancelable and non refundable.<\/p>\n<p>We regret that we cannot make exceptions for personal emergencies. We recommend that you consider purchasing tour cancellation insurance. Exceptions to this policy cannot be made for any reason, including weather, Force Majeure events, personal or medical emergencies.<\/p>\n<p><strong>Reselling and Changes to Booking<\/strong><br \/>\nDue to the nature of sports travel, resale of all Roadtrips packages is strictly prohibited. Packages can be transferred to friends and family provided changes are received a minimum of 30 days prior to travel. We are not able to make exceptions due to personal emergencies and we recommend travelers purchase travel medical insurance. If you require, your Sports Travel Specialist is able to direct you to Chubb Insurance for your Travel and Travel\/Medical insurance needs. Changes to event tickets or any other package inclusion is not permitted after purchase and confirmation of sports travel package.<\/p>\n<p><strong>Documentation and Personal Identification<\/strong><br \/>\nIt is the responsibility of each individual traveler to obtain the documentation required for their trip such as passports, visas, birth certificates and photo identification. Travelers entering the United States and Canada are required to show a passport for entry. Those denied at any border will not be entitled to any refund.<\/p>\n<p><strong>Canadian Goods &amp; Services Tax and Harmonized Sales Tax<\/strong><br \/>\nTravel packages occurring solely in Canada are subject to Canadian Goods and Services Tax.<\/p>\n<p><strong>Hotel Accommodations<\/strong><br \/>\nTraveler agrees to be responsible for all incidental charges incurred in excess of those covered by the package. Incidental charges can include food, beverages, telephone use, internet use, parking fees, and other hotel charges. All hotels require a credit card or deposit for incidental charges at time of check-in. Hotels expect departing guests to vacate rooms by approximately 12 noon and arriving guests to check-in later than approximately 3pm to allow for cleaning and housekeeping service. Host hotels do their best to minimize inconvenience and store luggage if you arrive early or need to depart late. Roadtrips reserves the right to substitute confirmed hotels with comparable accommodations at either their own or the hotel’s discretion. Accommodations are subject to availability. Names of travelers staying in the hotel must be provided to Roadtrips 30 days prior to travel. Late names, or name changes, that occur inside 30 days of travel will be charged a $50.00\/room fee. Late names, or name changes, that occur inside 14 days of travel will be charged a $75.00\/room fee.<\/p>\n<p><strong>Tickets (For Packages Including Event Tickets)<\/strong><br \/>\nUnless stated otherwise, Roadtrips is not and does not hold itself out to be the official ticket box office for the events in any travel package. Upon payment of the deposit, traveler acknowledges that Roadtrips often pays a premium to obtain tickets to sold out events and that Roadtrips accesses tickets from a variety of sources that may or may not include the official ticket sales channel and secondary ticket market sources. Traveler hereby gives permission to Roadtrips to use its best judgment and experience and all available ticket sources to provide the tickets included in the travel package. In the event that Roadtrips is not able to provide tickets ordered, or a reasonably comparable alternative, Roadtrips will reimburse the traveler an amount equal to the amount paid by the traveler for the tickets purchased but not delivered. This reimbursement will constitute the full and final extent of Roadtrips obligation to the traveler in respect to the non-delivery and any loss or damage, direct or indirect, arising there from. Masters Packages: The Masters Golf Tournament is a unique event in sports where patrons of Augusta National make their personal badges available for daily use during the Tournament. By providing a deposit on a badge inclusive Masters package the traveler understands the nature of those badges and understand they will be entering into a badge deposit contract onsite to receive their badges and that their credit card will be charged in the amount of $10,000.00 if they do not return the badges after day of play. That contract will be returned to the traveler upon return of the badge(s) to their Roadtrips host.<\/p>\n<p><strong>Credit Card Payments<\/strong><br \/>\nTraveler’s authorization to use their credit card number for deposit and\/or final payments indicates their complete compliance with our booking terms and conditions, whether or not traveler has actually signed the appropriate draft. Verbal authorization of traveler’s credit card confirms traveler’s reservation. Visa, MasterCard, American Express, checks and Electronic Funds Transfer (wire transfers) are all acceptable forms of payments. All payments made by check should be made payable to Roadtrips. Some credit card companies may impose a “Foreign Transaction Fee” even though your transaction is denominated in U.S. dollars. This is an arbitrary fee that occurs in a small number of cases and accrues entirely to the credit card–issuing bank. Roadtrips does not control these bank-imposed fees nor does Roadtrips derive any benefit from them, monetary or otherwise; we are therefore unable to accept responsibility for the fees.<\/p>\n<p><strong>Payment Rules<\/strong><br \/>\nPlease refer to the event specific payment schedules at Roadtrips.com and\/or in Roadtrips marketing documents. The initial deposit payment can be made by wire transfer, bank check, or credit card. All subsequent payments of $10,000 or more must be made by wire transfer, bank check, or personal check. All Credit Card payments greater than $10,000.00, with the exception of the initial deposit, are subject to a service fee of 2.65%. Late payments are subject to a late payment fee of 2.5% of the total outstanding balance of the invoice. This fee is automatically assessed at the point where a payment is past due. Payments that are more than 14 days in arrears are subject to immediate cancellation of the entire invoice with no refund.<\/p>\n<p><strong>Airline Reservations and Changes<\/strong><br \/>\nRoadtrips has no affiliation with any airline. Any airline reservations done on a traveler’s behalf by Roadtrips are subject to the applicable airline rules and regulations, changes and cancellation policies. Traveler is advised that it is their responsibility to re-confirm departure times with airlines.<\/p>\n<p><strong>Affiliation<\/strong><br \/>\nRoadtrips is not affiliated with any sports team, league, association or organization, unless otherwise stated.<\/p>\n<p><strong>Jurisdiction<\/strong><br \/>\nThese terms and conditions shall be governed by the law of the Province of Manitoba and of Canada where applicable. Any disputes regarding these terms and conditions shall be resolved exclusively in the courts of the Province of Manitoba, Canada.<\/p>\n<p>I have read, fully understand and agree to be bound contractually with Roadtrips by these terms and conditions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Roadtrips Terms &amp; Conditions Upon payment of the deposit, the buyers and travelers agree to be bound by the following terms and conditions. Roadtrips and sponsoring representative(s) (collectively “Roadtrips”) are acting solely as agents. Roadtrips is responsible for making the arrangements for accommodations, services and event tickets that constitute the travel package, except to the [&hellip;]<\/p>\n","protected":false},"author":12,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"better_featured_image":null,"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v14.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Roadtrips Inc Terms and Conditions\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.roadtrips.com\/terms-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms &amp; Conditions - Roadtrips\" \/>\n<meta property=\"og:description\" content=\"Roadtrips Inc Terms and Conditions\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.roadtrips.com\/terms-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Roadtrips\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/RoadtripsInc\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-19T17:48:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.roadtrips.com\/wp-content\/uploads\/2017\/02\/logo-roadtrips-dark.png\" \/>\n\t<meta property=\"og:image:width\" content=\"150\" \/>\n\t<meta property=\"og:image:height\" content=\"89\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@roadtripsinc\" \/>\n<meta name=\"twitter:site\" content=\"@roadtripsinc\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.roadtrips.com\/#organization\",\"name\":\"Roadtrips\",\"url\":\"https:\/\/www.roadtrips.com\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/RoadtripsInc\",\"https:\/\/instagram.com\/roadtripsinc\/\",\"http:\/\/www.linkedin.com\/company\/1002223?trk=tyah\",\"http:\/\/www.youtube.com\/user\/RoadtripsInc\",\"http:\/\/www.pinterest.com\/roadtripsinc\/\",\"https:\/\/twitter.com\/roadtripsinc\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.roadtrips.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.roadtrips.com\/wp-content\/uploads\/2016\/10\/rt-slogan.png\",\"width\":588,\"height\":203,\"caption\":\"Roadtrips\"},\"image\":{\"@id\":\"https:\/\/www.roadtrips.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.roadtrips.com\/#website\",\"url\":\"https:\/\/www.roadtrips.com\/\",\"name\":\"Roadtrips\",\"description\":\"The Ultimate in Sports Travel\",\"publisher\":{\"@id\":\"https:\/\/www.roadtrips.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.roadtrips.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.roadtrips.com\/terms-conditions\/#webpage\",\"url\":\"https:\/\/www.roadtrips.com\/terms-conditions\/\",\"name\":\"Terms & Conditions - Roadtrips\",\"isPartOf\":{\"@id\":\"https:\/\/www.roadtrips.com\/#website\"},\"datePublished\":\"2016-09-20T21:01:27+00:00\",\"dateModified\":\"2020-08-19T17:48:23+00:00\",\"description\":\"Roadtrips Inc Terms and Conditions\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.roadtrips.com\/terms-conditions\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","_links":{"self":[{"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/pages\/14"}],"collection":[{"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/comments?post=14"}],"version-history":[{"count":9,"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/pages\/14\/revisions"}],"predecessor-version":[{"id":35821,"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/pages\/14\/revisions\/35821"}],"wp:attachment":[{"href":"https:\/\/www.roadtrips.com\/wp-json\/wp\/v2\/media?parent=14"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}